particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble")

#include "ble_hal.h"

#if HAL_PLATFORM_BLE

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "gpio_hal.h"
#include "device_code.h"
#include "system_error.h"
#include "sdk_config_system.h"
#include "spark_wiring_vector.h"
#include <string.h>


using spark::Vector;


#define BLE_CONN_CFG_TAG                            1
#define BLE_OBSERVER_PRIO                           1

#define BLE_DISCOVERY_PROCEDURE_IDLE                0x00
#define BLE_DISCOVERY_PROCEDURE_SERVICES            0x01
#define BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS     0x02
#define BLE_DISCOVERY_PROCEDURE_DESCRIPTORS         0x03

#define BLE_GENERAL_PROCEDURE_TIMEOUT               5000 // In milliseconds
#define BLE_DICOVERY_PROCEDURE_TIMEOUT              15000 // In milliseconds

#define BLE_MAX_EVT_CB_COUNT                        2

#define NRF_CHECK_RETURN(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != NRF_SUCCESS) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return sysError(_ret); \
            } \
        } while (false)

#define NRF_CHECK_RETURN_VOID(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != NRF_SUCCESS) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
            } \
        } while (false)

#define CHECK_RETURN(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != SYSTEM_ERROR_NONE) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return _ret; \
            } \
        } while (false)


#define CHECK_RETURN_VOID(ret, str) \
        do { \
            const int _ret = ret; \
            const char* _str = str; \
            if (_ret != SYSTEM_ERROR_NONE) { \
                if (_str != nullptr) { \
                    LOG(ERROR, "%s failed: %u", _str, _ret); \
                } \
                return; \
            } \
        } while (false)


StaticRecursiveMutex s_bleMutex;

class bleLock {
    static void lock() {
        s_bleMutex.lock();
    }

    static void unlock() {
        s_bleMutex.unlock();
    }
};

typedef struct {
    hal_ble_evts_t arg;
} HalBleEvtMsg_t;

typedef struct {
    on_ble_evt_cb_t handler;
    void* context;
} HalBleEvtCb_t;

typedef struct {
    uint16_t       discStartHandle;
    uint16_t       discEndHandle;
    hal_ble_svc_t  services[BLE_MAX_SVC_COUNT];
    hal_ble_char_t characteristics[BLE_MAX_CHAR_COUNT];
    hal_ble_desc_t descriptors[BLE_MAX_DESC_COUNT];
    uint8_t        discAll : 1;
    uint8_t        count;
    uint8_t        currIndex;
    uint8_t        currDiscProcedure;
    os_semaphore_t semaphore;
} HalBleDiscovery_t;

// TODO: used when muti-role is implemented
typedef struct {
    uint16_t connHandles[BLE_MAX_LINK_COUNT];
    hal_ble_addr_t peerAddrs[BLE_MAX_LINK_COUNT];
} HalBleConnections_t;

/* BLE Instance */
typedef struct {
    uint8_t  initialized  : 1;
    uint8_t  connecting   : 1;
    uint8_t  discovering  : 1;
    uint8_t  connected    : 1;
    uint8_t  role;
    uint16_t connHandle;
    uint8_t  connParamsUpdateAttempts;

    hal_ble_conn_params_t ppcp;

    os_semaphore_t connectSemaphore;
    os_semaphore_t disconnectSemaphore;
    os_semaphore_t connUpdateSemaphore;
    os_semaphore_t discoverySemaphore;
    os_semaphore_t readWriteSemaphore;
    os_queue_t     evtQueue;
    os_thread_t    evtThread;
    os_timer_t     connParamsUpdateTimer;

    hal_ble_conn_params_t effectiveConnParams;
    ble_gap_addr_t        whitelist[BLE_MAX_WHITELIST_ADDR_COUNT];
    ble_gap_addr_t const* whitelistPointer[BLE_MAX_WHITELIST_ADDR_COUNT];

    HalBleDiscovery_t     discovery;

    uint16_t readAttrHandle;
    uint8_t  readData[20];
    uint16_t readDataLen;

    HalBleEvtCb_t evtCbs[BLE_MAX_EVT_CB_COUNT];
} HalBleInstance_t;


static HalBleInstance_t s_bleInstance = {
    .initialized  = 0,
    .connecting   = 0,
    .discovering  = 0,
    .connected    = 0,
    .role         = BLE_ROLE_INVALID,
    .connHandle   = BLE_INVALID_CONN_HANDLE,
    .connParamsUpdateAttempts = 0,

    /*
     * For BLE Central, this is the initial connection parameters.
     * For BLE Peripheral, this is the Peripheral Preferred Connection Parameters.
     */
    .ppcp = {
        .version           = 0x01,
        .min_conn_interval = BLE_DEFAULT_MIN_CONN_INTERVAL,
        .max_conn_interval = BLE_DEFAULT_MAX_CONN_INTERVAL,
        .slave_latency     = BLE_DEFAULT_SLAVE_LATENCY,
        .conn_sup_timeout  = BLE_DEFAULT_CONN_SUP_TIMEOUT
    },

    .connectSemaphore = NULL,
    .disconnectSemaphore = NULL,
    .connUpdateSemaphore = NULL,
    .discoverySemaphore = NULL,
    .readWriteSemaphore = NULL,
    .evtQueue  = NULL,
    .evtThread = NULL,
    .connParamsUpdateTimer = NULL,
};

