particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            bool terminate = true;
            if ( (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS)
              && (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_SERVICES) ) {
                for (uint8_t i = 0; i < svcCount; i++) {
                    s_bleInstance.discovery.services[s_bleInstance.discovery.count].start_handle = event->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].handle_range.start_handle;
                    s_bleInstance.discovery.services[s_bleInstance.discovery.count].end_handle   = event->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].handle_range.end_handle;
                    toHalUuid(&event->evt.gattc_evt.params.prim_srvc_disc_rsp.services[i].uuid, &s_bleInstance.discovery.services[s_bleInstance.discovery.count].uuid);
                    s_bleInstance.discovery.count++;
                    if (s_bleInstance.discovery.count >= BLE_MAX_SVC_COUNT) {
                        break;
                    }
                }
                uint16_t currEndHandle = event->evt.gattc_evt.params.prim_srvc_disc_rsp.services[svcCount-1].handle_range.end_handle;
                if ( (s_bleInstance.discovery.discAll)
                  && (s_bleInstance.discovery.count < BLE_MAX_SVC_COUNT)
                  && (currEndHandle < 0xFFFF) ) {
                    ret = sd_ble_gattc_primary_services_discover(event->evt.gattc_evt.conn_handle, currEndHandle + 1, NULL);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
                    }
                    else {
                        terminate = false;
                    }
                }
            }
            else {
                LOG(ERROR, "BLE service discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }

            if (terminate) {
                msg.arg.type = BLE_EVT_SVC_DISCOVERED;
                msg.arg.params.svc_disc.version = 0x01;
                msg.arg.params.svc_disc.conn_handle = event->evt.gattc_evt.conn_handle;
                msg.arg.params.svc_disc.count = s_bleInstance.discovery.count;
                msg.arg.params.svc_disc.services = s_bleInstance.discovery.services;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                    // This flag should be cleared after this event being popped, in case that
                    // further operation is needed to retrieve 128-bits UUID. If this event is
                    // not enqueued successfully, this flag should be clear here.
                    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                    s_bleInstance.discovering = false;
                    os_semaphore_give(s_bleInstance.discoverySemaphore, false);
                }
            }
        } break;

        case BLE_GATTC_EVT_CHAR_DISC_RSP: {
            uint8_t charCount = event->evt.gattc_evt.params.char_disc_rsp.count;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d characteristic discovered.", charCount);

            bool terminate = true;
            if ( (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS)
              && (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS) ) {
                for (uint8_t i = 0; i < charCount; i++) {
                    s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].char_ext_props = event->evt.gattc_evt.params.char_disc_rsp.chars[i].char_ext_props;
                    s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].properties     = toHalCharacteristicProperties(event->evt.gattc_evt.params.char_disc_rsp.chars[i].char_props);
                    s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].decl_handle    = event->evt.gattc_evt.params.char_disc_rsp.chars[i].handle_decl;
                    s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].value_handle   = event->evt.gattc_evt.params.char_disc_rsp.chars[i].handle_value;
                    toHalUuid(&event->evt.gattc_evt.params.char_disc_rsp.chars[i].uuid, &s_bleInstance.discovery.characteristics[s_bleInstance.discovery.count].uuid);

                    s_bleInstance.discovery.count++;
                    if (s_bleInstance.discovery.count >= BLE_MAX_CHAR_COUNT) {
                        break;
                    }
                }

                uint16_t currEndHandle = event->evt.gattc_evt.params.char_disc_rsp.chars[charCount-1].handle_value;
                if ( (currEndHandle < s_bleInstance.discovery.discEndHandle)
                  && (s_bleInstance.discovery.count < BLE_MAX_CHAR_COUNT) ) {
                    ble_gattc_handle_range_t handleRange;
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle   = s_bleInstance.discovery.discEndHandle;
                    ret = sd_ble_gattc_characteristics_discover(event->evt.gattc_evt.conn_handle, &handleRange);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gattc_characteristics_discover() failed: %u", (unsigned)ret);
                    }
                    else {
                        terminate = false;
                    }
                }
            }
            else {
                LOG(ERROR, "BLE characteristic discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }

            if (terminate) {
                msg.arg.type = BLE_EVT_CHAR_DISCOVERED;
                msg.arg.params.char_disc.version = 0x01;
                msg.arg.params.char_disc.conn_handle = event->evt.gattc_evt.conn_handle;
                msg.arg.params.char_disc.count = s_bleInstance.discovery.count;
                msg.arg.params.char_disc.characteristics = s_bleInstance.discovery.characteristics;
                if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                    LOG(ERROR, "os_queue_put() failed.");
                    // This flag should be cleared after this event being popped, in case that
                    // further operation is needed to retrieve 128-bits UUID. If this event is
                    // not enqueued successfully, this flag should be clear here.
                    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                    s_bleInstance.discovering = false;
                    os_semaphore_give(s_bleInstance.discoverySemaphore, false);
                }
            }
        } break;

        case BLE_GATTC_EVT_DESC_DISC_RSP: {
            uint8_t descCount = event->evt.gattc_evt.params.desc_disc_rsp.count;
            LOG_DEBUG(TRACE, "BLE GATT Client event: %d descriptors discovered.", descCount);

