particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            msg.arg.type = BLE_EVT_DATA_NOTIFIED;
            msg.arg.params.data_rec.version = 0x01;
            msg.arg.params.data_rec.conn_handle = event->evt.gattc_evt.conn_handle;
            msg.arg.params.data_rec.attr_handle = event->evt.gattc_evt.params.hvx.handle;
            msg.arg.params.data_rec.offset = 0;
            msg.arg.params.data_rec.data_len = event->evt.gattc_evt.params.hvx.len;
            memcpy(msg.arg.params.data_rec.data, event->evt.gattc_evt.params.hvx.data, msg.arg.params.data_rec.data_len);
            if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);

            // Disconnect on GATT Client timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");

            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request.");

            uint16_t clientMtu = event->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu;
            LOG_DEBUG(TRACE, "Effective Client RX MTU: %d.", clientMtu);

            uint16_t effectMtu = clientMtu > NRF_SDH_BLE_GATT_MAX_MTU_SIZE ? NRF_SDH_BLE_GATT_MAX_MTU_SIZE : clientMtu;
            ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, effectMtu);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_exchange_mtu_reply() failed: %u", (unsigned)ret);
            }
            LOG_DEBUG(TRACE, "Reply with Server RX MTU: %d.", effectMtu);

            msg.arg.type = BLE_EVT_GATT_PARAMS_UPDATED;
            msg.arg.params.gatt_params_updated.version = 0x01;
            msg.arg.params.gatt_params_updated.conn_handle = event->evt.gatts_evt.conn_handle;
            msg.arg.params.gatt_params_updated.att_mtu_size = effectMtu;
            if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GATTS_EVT_WRITE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: write characteristic, handle: %d, len: %d.",
                    event->evt.gatts_evt.params.write.handle, event->evt.gatts_evt.params.write.len);

            // TODO: deal with different write commands.
            msg.arg.type = BLE_EVT_DATA_WRITTEN;
            msg.arg.params.data_rec.version = 0x01;
            msg.arg.params.data_rec.conn_handle = event->evt.gatts_evt.conn_handle;
            msg.arg.params.data_rec.attr_handle = event->evt.gatts_evt.params.write.handle;
            msg.arg.params.data_rec.offset = event->evt.gatts_evt.params.write.offset;
            msg.arg.params.data_rec.data_len = event->evt.gatts_evt.params.write.len;
            memcpy(msg.arg.params.data_rec.data, event->evt.gatts_evt.params.write.data, msg.arg.params.data_rec.data_len);
            if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
            os_semaphore_give(s_bleInstance.readWriteSemaphore, false);
        } break;

        case BLE_GATTS_EVT_HVC: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
            os_semaphore_give(s_bleInstance.readWriteSemaphore, false);
        } break;

        case BLE_GATTS_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);

            // Disconnect on GATT Server timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        default: {
            //LOG_DEBUG(TRACE, "Unhandled BLE event: %u", (unsigned)event->header.evt_id);
        } break;
    }
}

static os_thread_return_t handleBleEventThread(void* param) {
    while (1) {
        HalBleEvtMsg_t msg;
        if (!os_queue_take(s_bleInstance.evtQueue, &msg, CONCURRENT_WAIT_FOREVER, NULL)) {
            // Try retrieving 128-bits service or characteristic UUID before dispatching this event.
            if (   msg.arg.type == BLE_EVT_SVC_DISCOVERED
                || msg.arg.type == BLE_EVT_CHAR_DISCOVERED
                || msg.arg.type == BLE_EVT_DESC_DISCOVERED) {
                if (msg.arg.type == BLE_EVT_SVC_DISCOVERED) {
                    hal_ble_gattc_on_svc_disc_evt_t *svcDiscEvt = (hal_ble_gattc_on_svc_disc_evt_t*)&msg.arg.params;
                    for (uint8_t i = 0; i < svcDiscEvt->count; i++) {
                        if (svcDiscEvt->services[i].uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
                            if (!os_semaphore_create(&s_bleInstance.discovery.semaphore, 1, 0)) {
                                ret_code_t ret = sd_ble_gattc_read(svcDiscEvt->conn_handle, svcDiscEvt->services[i].start_handle, 0);
                                if (ret == NRF_SUCCESS) {
                                    s_bleInstance.discovery.currIndex = i;
                                    if (!os_semaphore_take(s_bleInstance.discovery.semaphore, BLE_GENERAL_PROCEDURE_TIMEOUT, false)) {
                                        os_semaphore_destroy(s_bleInstance.discovery.semaphore);
                                        continue;
                                    }
                                }
                                else {
                                    LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
                                }
                                os_semaphore_destroy(s_bleInstance.discovery.semaphore);
                                break;
                            }
                            else {
                                LOG(ERROR, "os_semaphore_create() failed");
                                break;
                            }
                        }
                    }
                }
                else if (msg.arg.type == BLE_EVT_CHAR_DISCOVERED) {
                    hal_ble_gattc_on_char_disc_evt_t* charDiscEvt = (hal_ble_gattc_on_char_disc_evt_t*)&msg.arg.params;
                    for (uint8_t i = 0; i < charDiscEvt->count; i++) {
                        if (charDiscEvt->characteristics[i].uuid.type == BLE_UUID_TYPE_128BIT_SHORTED) {
                            if (!os_semaphore_create(&s_bleInstance.discovery.semaphore, 1, 0)) {
                                ret_code_t ret = sd_ble_gattc_read(charDiscEvt->conn_handle, charDiscEvt->characteristics[i].decl_handle, 0);
                                if (ret == NRF_SUCCESS) {
                                    s_bleInstance.discovery.currIndex = i;
                                    if (!os_semaphore_take(s_bleInstance.discovery.semaphore, 2000, false)) {
                                        os_semaphore_destroy(s_bleInstance.discovery.semaphore);
                                        continue;
                                    }
                                }
                                else {
                                    LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
                                }
                                os_semaphore_destroy(s_bleInstance.discovery.semaphore);
                                break;
                            }
                            else {
                                LOG(ERROR, "os_semaphore_create() failed");
                                break;
                            }
                        }
                    }
                }
            }

