particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    int getScanParams(hal_ble_scan_params_t* params) const {
        if (params == nullptr) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        memcpy(params, &scanParams_, sizeof(hal_ble_scan_params_t));
        return SYSTEM_ERROR_NONE;
    }

    int startScanning(bool restart) {
        if(restart) {
            int ret = sd_ble_gap_scan_start(NULL, &bleScanData_);
            NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_start");
            return SYSTEM_ERROR_NONE;
        }

        if (isScanning_) {
            return SYSTEM_ERROR_INVALID_STATE;
        }
        if (os_semaphore_create(&scanSemaphore_, 1, 0)) {
            LOG(ERROR, "os_semaphore_create() failed");
            return SYSTEM_ERROR_INTERNAL;
        }

        ble_gap_scan_params_t bleGapScanParams;
        toPlatformScanParams(&bleGapScanParams);

        LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
        LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
                bleGapScanParams.interval*0.625, bleGapScanParams.window*0.625, bleGapScanParams.timeout*10);

        cache_.clear();

        int ret = sd_ble_gap_scan_start(&bleGapScanParams, &bleScanData_);
        NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_start");

        isScanning_ = true;
        os_semaphore_take(scanSemaphore_, CONCURRENT_WAIT_FOREVER, false);
        os_semaphore_destroy(scanSemaphore_);

        return SYSTEM_ERROR_NONE;
    }

    int stopScanning(void) {
        if (!isScanning_) {
            return SYSTEM_ERROR_NONE;
        }

        int ret = sd_ble_gap_scan_stop();
        NRF_CHECK_RETURN(ret, "sd_ble_gap_scan_stop");

        os_semaphore_give(scanSemaphore_, false);
        isScanning_ = false;

        return SYSTEM_ERROR_NONE;
    }

    void toPlatformScanParams(ble_gap_scan_params_t* params) const {
        memset(params, 0x00, sizeof(ble_gap_scan_params_t));
        params->extended = 0;
        params->active = scanParams_.active;
        params->interval = scanParams_.interval;
        params->window = scanParams_.window;
        params->timeout = scanParams_.timeout;
        params->scan_phys = BLE_GAP_PHY_1MBPS;
        params->filter_policy = scanParams_.filter_policy;
    }

private:
    uint8_t isScanning_: 1;                                 /**< If it is scanning or not. */
    hal_ble_scan_params_t scanParams_;                      /**< BLE scanning parameters. */
    os_semaphore_t scanSemaphore_;                          /**< Semaphore to wait until the scan procedure completed. */
    uint8_t scanReportBuff_[BLE_MAX_SCAN_REPORT_BUF_LEN];   /**< Buffer to hold the scanned report data. */
    ble_data_t bleScanData_;                                /**< BLE scanned data. */
    Vector<hal_ble_addr_t> cache_;                          /**< Cached address of scanned devices to filter-out duplicated result. */

    Observer() {
        isScanning_ = false;

        scanParams_.version = 0x01;
        scanParams_.active = true;
        scanParams_.filter_policy = BLE_SCAN_FP_ACCEPT_ALL;
        scanParams_.interval = BLE_DEFAULT_SCANNING_INTERVAL;
        scanParams_.window = BLE_DEFAULT_SCANNING_WINDOW;
        scanParams_.timeout = BLE_DEFAULT_SCANNING_TIMEOUT;

        scanSemaphore_ = NULL;

        bleScanData_.p_data = scanReportBuff_;
        bleScanData_.len = sizeof(scanReportBuff_);

        observerImpl.instance = this;
        NRF_SDH_BLE_OBSERVER(bleObserver, 1, processObserverEvents, &observerImpl);
    }

    ~Observer() = default;

    bool chacheDevice(const hal_ble_addr_t& newAddr) {
        for (int i = 0; i < cache_.size(); i++) {
            const hal_ble_addr_t& existAddr = cache_[i];
            if (existAddr.addr_type == newAddr.addr_type &&
                    !memcmp(existAddr.addr, newAddr.addr, BLE_SIG_ADDR_LEN)) {
                LOG_DEBUG(TRACE, "Duplicated scan result. Filter it out.");
                return false;
            }
        }
        cache_.append(newAddr);
        return true;
    }

    static void processObserverEvents(const ble_evt_t* event, void* context) {
        Observer* observer = static_cast<ObserverImpl*>(context)->instance;
        HalBleEvtMsg_t msg;
        memset(&msg, 0x00, sizeof(HalBleEvtMsg_t));
        switch (event->header.evt_id) {
            case BLE_GAP_EVT_ADV_REPORT: {
                LOG_DEBUG(TRACE, "BLE GAP event: advertising report.");

                hal_ble_addr_t newAddr;
                newAddr.addr_type = event->evt.gap_evt.params.adv_report.peer_addr.addr_type;
                memcpy(newAddr.addr, event->evt.gap_evt.params.adv_report.peer_addr.addr, BLE_SIG_ADDR_LEN);
                if (observer->chacheDevice(newAddr)) {
                    // The new scanned device is not in the cached device list.
                    msg.arg.type = BLE_EVT_SCAN_RESULT;
                    msg.arg.params.scan_result.version = 0x01;
                    msg.arg.params.scan_result.type.connectable = event->evt.gap_evt.params.adv_report.type.connectable;
                    msg.arg.params.scan_result.type.scannable = event->evt.gap_evt.params.adv_report.type.scannable;
                    msg.arg.params.scan_result.type.directed = event->evt.gap_evt.params.adv_report.type.directed;
                    msg.arg.params.scan_result.type.scan_response = event->evt.gap_evt.params.adv_report.type.scan_response;
                    msg.arg.params.scan_result.type.extended_pdu = event->evt.gap_evt.params.adv_report.type.extended_pdu;
                    msg.arg.params.scan_result.rssi = event->evt.gap_evt.params.adv_report.rssi;
                    msg.arg.params.scan_result.data_len = event->evt.gap_evt.params.adv_report.data.len;
                    memcpy(msg.arg.params.scan_result.data, event->evt.gap_evt.params.adv_report.data.p_data, msg.arg.params.scan_result.data_len);
                    msg.arg.params.scan_result.peer_addr.addr_type = newAddr.addr_type;
                    memcpy(msg.arg.params.scan_result.peer_addr.addr, newAddr.addr, BLE_SIG_ADDR_LEN);
                    if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                        LOG(ERROR, "os_queue_put() failed.");
                    }
                }

                // Continue scanning, scanning parameters pointer must be set to NULL.
                observer->startScanning(true);
            } break;

            case BLE_GAP_EVT_TIMEOUT: {
                if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                    LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                    observer->isScanning_ = false;

